project_ci/app/Controllers/Productos.php

    public function index() {
        $productosModel = new ProductosModel();
        $productos = $productosModel->findAll();
---
SELECT *
FROM `productos`

    public function verDetalle($productoId)
    {
        $productosModel = new ProductosModel();
        $producto = $productosModel->find($productoId);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'